Revit 2024 API
RebarShapeArcReferenceType Enumeration
 A Rebar Shape Definition constraint that is measured to a bend must take the bar diameter into account by specifying whether it measures to the exterior, centerline, or interior of the bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum RebarShapeArcReferenceType
Visual Basic
Public Enumeration RebarShapeArcReferenceType
Visual C++
public enum class RebarShapeArcReferenceType
Members
Member name | Description
Internal |  Measure to the interior of the bend.
Centerline |  Measure to the centerline of the bar.
External |  Measure to the exterior of the bend.
See Also
Autodesk.Revit.DB.Structure Namespace